# Pipe Fitting And Accessory Pressure Drop Item Begin Connector Index Property

Source: https://www.revitapidocs.com/2026/4d6c6f2b-e921-e019-7386-dc55dc52eb0a.htm

---

| Pipe Fitting And Accessory Pressure Drop Item Begin Connector Index Property |
| --- |

The index of the begin connector of the flow path.
**Namespace:** Autodesk.Revit.DB.Plumbing
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int BeginConnectorIndex { get; }
```

```
Public ReadOnly Property BeginConnectorIndex As Integer
	Get
```

```
public:
property int BeginConnectorIndex {
	int get ();
}
```

```
member BeginConnectorIndex : int with get
```

#### Property Value

Int32 See Also

#### Reference

PipeFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Plumbing Namespace